tests/src/serviceTest/resources/request/consultationDroits/v1/carteTP_test_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" >    <soap:Body>        <ns5:getInfoBddRequest xmlns="http://norme.cegedimassurances.com/commun"  xmlns:ns2="http://norme.cegedimassurances.com/base_de_droit"  xmlns:ns3="http://norme.cegedimassurances.com/beneficiaire"  xmlns:ns4="http://norme.cegedimassurances.com/amc"  xmlns:ns5="http://ws.cegedimassurance.com/basededroit/wsdl" >            <ns2:header_in>                <headerTech>                    <id_logiciel_client>CCMO - Espace adhérent</id_logiciel_client>                    <version_logiciel_client>1</version_logiciel_client>                    <id_session_serveur>979beac2-f0e7-4ace-8ac5-66d419bdc1d4</id_session_serveur>                </headerTech>                <headerFonc>                    <code_contexte>CD-01</code_contexte>                    <code_proprietaire>0000452433</code_proprietaire>                </headerFonc>            </ns2:header_in>            <ns2:beneficiaire>                <ns3:NIR_certifie>2810631555490</ns3:NIR_certifie>                <ns3:cle_NIR>69</ns3:cle_NIR>                <ns3:date_naissance>19810619</ns3:date_naissance>                <ns3:rang_gemellaire>1</ns3:rang_gemellaire>            </ns2:beneficiaire>            <ns2:amc>                <ns4:numero_AMC_prefectoral>0000452433</ns4:numero_AMC_prefectoral>            </ns2:amc>            <ns2:info_bdd>                <ns2:type_recherche_benef>1</ns2:type_recherche_benef>                <ns2:type_recherche_segment>2</ns2:type_recherche_segment>                <ns2:type_profondeur_recherche>1</ns2:type_profondeur_recherche>            </ns2:info_bdd>            <ns2:dates>                <date_reference>2018-03-05</date_reference>                <type_date_reference>1</type_date_reference>            </ns2:dates>        </ns5:getInfoBddRequest>    </soap:Body></soap:Envelope>